hleserg/Attadipa/firmware/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-2.06 — the board on the desk.
#
# Every value here traces to a fact in docs/research/, and the comment says
# which. Nothing is copied from a vendor example without that trace, because a
# vendor example is a claim about *their* build, not a measurement of this part.
#
# `idf.py set-target esp32s3` writes CONFIG_IDF_TARGET; it is here as well so a
# clean checkout that skips that step still fails loudly rather than silently
# building for something else.
CONFIG_IDF_TARGET="esp32s3"

# The die is ESP32-S3R8, revision v0.2, and no later revision exists. All eight
# errata in sheet v1.3 apply — ESP32S3_ERRATA_V02.md. Minimum revision must stay
# at 0 or the bootloader refuses this chip outright.
# HARDWARE_MATRIX.md "Core", WAVESHARE_EFUSE_READ.md §1.1.
CONFIG_ESP32S3_REV_MIN_0=y

# Flash: GD25Q256EYIGR, JEDEC 0xC8 0x4019, physically 32 MB, quad, 3.3 V, and
# the vendor's own bootloader brings it up QIO at 80 MHz.
# WAVESHARE_EFUSE_READ.md §1.3.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# The build will report `--flash_mode dio` even though QIO is selected above,
# and that is correct rather than a setting that failed to take. ESP-IDF derives
# the *image header* mode as `dio` for every quad choice, because the ROM reads
# the header before anything has configured the bus; the second-stage bootloader
# switches to QIO afterwards. `components/esptool_py/Kconfig.projbuild:81`.
# Left here because the obvious reaction to seeing `dio` is to "fix" it.

# 16 MB, and the part is 32 MB. That is not a mistake: only the low half is
# addressable by the ROM and the second-stage bootloader, and what a *running*
# application may do above the line is UNKNOWN and unmeasured
# (FLASH_ADDRESSING_LIMITS.md). Declaring the addressable size makes ESP-IDF's
# own partition-table check enforce the ceiling as well, which is a free second
# guard beside tools/flash/partition_check.py. It also means the bootloader
# prints the mismatch on every boot — that log line is the reminder, and it
# stops being one on the day somebody measures the upper half.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM: 8 MB octal. The eFuses give capacity and rail — PSRAM_CAP = 8M,
# PSRAM_VENDOR = AP_3v3, so R8 and not the 1.8 V R8V — and the datasheet's
# Table 1-1 supplies the bus width, because no 8 MB quad in-package part exists.
# GPIO33–37 (octal's DQ4–DQ7 and DQS) sit unrouted on the schematic, which is
# where they belong on an octal part. D12a, HARDWARE_MATRIX.md "Core".
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Reach app_main even when PSRAM does not answer so the serial diagnostic names
# the failure. Every future PSRAM consumer must still check initialisation before
# use; ignoring discovery failure is not permission to use absent memory.
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# The only console this board exposes. There is no UART bridge: USB D-/D+ land
# straight on GPIO 19/20, the SoC's native USB pins — HARDWARE_MATRIX.md "USB".
#
# Choosing it also decides something this project has been burnt by. Selecting
# USB-Serial/JTAG here sets CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM to 4 rather
# than -1 (`components/esp_system/Kconfig:362`), so **esp_rom_printf works in
# this build**. The image that went mute in WAVESHARE_RUNNING_OUR_CODE.md §2.4
# was built with CONFIG_ESP_CONSOLE_NONE, which sets that number to -1 and sends
# the ROM's putc nowhere at all. The rule that generalises is not "never use
# esp_rom_printf" — it is that this symbol decides whether it writes anywhere,
# so anything that turns the console off silently takes it with it.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# This file is the PRODUCTION profile, and the USB watch-control endpoint is
# deliberately absent from it. The endpoint speaks an unauthenticated protocol:
# CRC and a version byte prove a frame is well formed, not that the host on the
# other end of the cable is the owner's. Anything that can open the CDC device
# could read the screen, inject touch and buttons, write host time as trusted,
# and drive a live MeshCore session (#346). Leaving it on by default published
# a control plane to every USB port the watch is ever plugged into.
#
# Turning it off used to be impossible without breaking the product, because
# one symbol owned both the endpoint and the touch, button and sleep paths.
# It does not any more -- physical_input.cpp is compiled into every image --
# so `n` here costs the product nothing.
#
# `idf.py -B build-hil -DSDKCONFIG=build-hil/sdkconfig \
#     -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.hil" build`
# is the development image. It is an explicit, named choice, it says so in the
# boot log, and tools/flash/firmware_elf_check.py is what keeps the two apart:
# a flash image carrying the endpoint's dispatcher fails that check.
#
# CONFIG_LV_USE_SNAPSHOT is not repeated here or in sdkconfig.hil: the screenshot
# buffer has exactly one caller, so ATTADIPA_WATCH_CONTROL selects it and the two
# symbols cannot drift apart in two files again.
CONFIG_ATTADIPA_WATCH_CONTROL=n

# T-168 talks to a stock MeshCore Companion as a BLE central. Only the central,
# observer and GATT-client roles are built; the watch does not advertise a
# service of its own. Bond keys persist because the node requires MITM pairing
# and forcing a new pairing after every reboot is neither useful nor testable.
# The Companion frame budget is 176 bytes, while a BLE operation is bounded by
# negotiated MTU minus three; firmware checks that measured value before every
# write instead of treating this preferred value as a fact about the peer.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_STATIC_PASSKEY=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256

# A development table, and partitions.csv says so in its own header.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The libraries under core/, platform/, link/ and l10n/ are C++17 and build
# without exceptions or RTTI today. Keeping both off is ESP-IDF's default; it is
# stated rather than inherited so that turning one on is a visible decision.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# LVGL object creation runs in app_main before its own task takes over. The
# ESP-IDF default main-task stack is too small for that measured call path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_FONT_MONTSERRAT_28=y

# Nothing here works around an erratum, and that is a checked statement rather
# than an omission. All eight errata in sheet v1.3 apply to this die and none of
# them wants a value in this file: six are handled automatically by ESP-IDF
# behind hidden symbols that cannot be switched, USBOTG-4289 is an eFuse and not
# a software matter, and TOUCH-100 is application code that belongs with the
# touch driver (T-166). ADC-183's escape hatch,
# CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3, is deliberately left at its `n`
# default — it re-enables a mode the erratum broke.
# docs/research/ESP32S3_ERRATA_V02.md §1.
